Revit 2027 API
NurbsSurfaceData.GetControlPoint Method
 Get the list of control points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetControlPoint(
	int idx
)
Public Function GetControlPoint (
	idx As Integer
) As XYZ
public:
XYZ^ GetControlPoint(
	int idx
)
member GetControlPoint :
        idx : int -> XYZ
Parameters
idx Int32
 The index of the control point.
Return Value
XYZ
Exceptions
Exception | Condition
ArgumentException |  Out-of-range access.
See Also
Reference
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace